keerthika3-git/GPIO_APIs_Testing/drivers/Inc/stm32f411xx_uart_driver.h
/*
 * stm32f411xx_uart_driver.h
 *
 *  Created on: Dec 10, 2024
 *      Author: keerthika.m
 */

#ifndef INC_STM32F411XX_UART_DRIVER_H_
#define INC_STM32F411XX_UART_DRIVER_H_
#include "stm32f411xx.h"


///***** CONFIGURATION STRUCTURE FOR USART PIN ******/
//typedef struct{
//	uint8_t USART_Mode;               /* possible values from @USART_Mode */
//	uint8_t USART_Baud;               /* possible values from @USART_Baud */
//	uint8_t USART_NoOfStopBits;       /* possible values from @USART_NoOfStopBits */
//	uint8_t USART_WordLength;         /* possible values from @USART_WordLength*/
//    uint8_t USART_ParityControl;      /* possible values from @USART_ParityControl */
//    uint8_t USART_HWFlowControl;      /* possible values from @USART_HWFlowControl*/
//}USART_Config_t;
//
//
///* Handle structure for USARTX */
//typedef struct{
//	USART_RegDef_t *pUSARTx;       // pointer to hold base address of USARTx
//	USART_Config_t  USART_Config;   // holds USART pin configuration
//	uint8_t *pTxBuffer;
//	uint8_t *pRxBuffer;
//	uint32_t TxLen;
//	uint32_t RxLen;
//	uint8_t TxBusyState;
//	uint8_t RxBusyState;
//}USART_Handle_t;
//
//
///*
// * @USART_Mode
// */
//#define USART_MODE_ONLY_TX  0
//#define USART_MODE_ONLY_RX  1
//#define USART_MODE_TXRX     2
//
///*
// *@USART_Baud
// */
//#define USART_STD_BAUD_1200          1200
//#define USART_STD_BAUD_2400          2400
//#define USART_STD_BAUD_9600          9600
//#define USART_STD_BAUD_19200         19200
//#define USART_STD_BAUD_38400         38400
//#define USART_STD_BAUD_57600         57600
//#define USART_STD_BAUD_115200        115200
//#define USART_STD_BAUD_230400        230400
//#define USART_STD_BAUD_46000         4600
//#define USART_STD_BAUD_92100         92100
//#define USART_STD_BAUD_2M            2000000
//#define USART_STD_BAUD_3M            3000000
//
///*
// * @USART_ParityControl
// */
//#define USART_PARITY_EN_ODD       2
//#define USART_PARITY_EN_EVEN      1
//#define USART_PARITY_DISABLE   0
//
///*
// * @USART_WordLength
// */
//#define USART_WORDLEN_8BITS   0
//#define USART_WORDLEN_9BITS   1
//
///*
// * @USART_NoOfStopBits
// */
//#define USART_STOPBITS_1     0
//#define USART_STOPBITS_0_5   1
//#define USART_STOPBITS_2     2
//#define USART_STOPBITS_1_5   3
//
///*
// * @USART_HWFlowControl
// */
//#define USART_HW_FLOW_CTRL_NONE      0
//#define USART_HW_FLOW_CTRL_CTS       1
//#define USART_HW_FLOW_CTRL_RTS       2
//#define USART_HW_FLOW_CTRL_CTS_RTS   3
//
///*
// * USART flags
// */
//
//#define USART_FLAG_TXE 			( 1 << USART_SR_TXE)
//#define USART_FLAG_RXNE 		( 1 << USART_SR_RXNE)
//#define USART_FLAG_TC 			( 1 << USART_SR_TC)
//
///*
// * Application states
// */
//#define USART_BUSY_IN_RX   1
//#define USART_BUSY_IN_TX   2
//#define USART_READY        0
//
//
//#define 	USART_EVENT_TX_CMPLT   0
//#define		USART_EVENT_RX_CMPLT   1
//#define		USART_EVENT_IDLE       2
//#define		USART_EVENT_CTS        3
//#define		USART_EVENT_PE         4
//#define		USART_ERR_FE     	   5
//#define		USART_ERR_NE    	   6
//#define		USART_ERR_ORE    	   7
//
//
//
///* APIs SUPPORTED BY THIS DRIVER  */
//
//void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);
///* Peripheral Clock setup*/
//
//void USART_PeriClockControl(USART_RegDef_t *pUSARTx,uint8_t EnorDi); //first parameter point to base address of USARTOx register
//                                                                  //second parameter variable to hold enable or disable clock value
//
///*
// * Init and DeInit
// */
//void USART_INIT(USART_Handle_t *pUSARTHandle);
//void USART_DeInit(USART_RegDef_t *pUSARTx);
//
///*
// * Data Send and Receive
// */
//void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len);
//void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
//uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer,uint32_t Len);
//uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer,uint32_t Len);
//
//
///* IRQ CONFIGURATION AND ISR HANDLING */
//
// void USART_IRQInterruptConfig(uint8_t IRQNumber,uint8_t EnorDis);//In IRQconfig need IRQ number,enable or disable
//
// void USART_IRQPriority(uint8_t IRQNumber,uint32_t IRQPriority);//priority
//
// void USART_IRQHandling(USART_Handle_t *pHandle);
//
//
///*
//  * Peripheral Control APIs
//  */
//
//void USART_Peripheralcontrol(USART_RegDef_t *pUSARTx, uint8_t EnorDi); //to enable USART Peripheral
//
//uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName);
//void USART_ClearFlag(USART_RegDef_t *pUSARTx , uint16_t FlagName);
//
//
//
///*
// * application callback
// */
//void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEvent);


typedef struct
{
	uint8_t USART_Mode;
	uint32_t USART_Baud;
	uint8_t USART_NoOfStopBits;
	uint8_t USART_WordLength;
	uint8_t USART_ParityControl;
	uint8_t USART_HWFlowControl;
}USART_Config_t;


/*
 * Handle structure for USARTx peripheral
 */
typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t   USART_Config;
	uint8_t *pTxBuffer;
	uint8_t *pRxBuffer;
	uint32_t TxLen;
	uint32_t RxLen;
	uint8_t TxBusyState;
	uint8_t RxBusyState;
}USART_Handle_t;



/*
 *@USART_Mode
 *Possible options for USART_Mode
 */
#define USART_MODE_ONLY_TX 	0
#define USART_MODE_ONLY_RX 	1
#define USART_MODE_TXRX  	2

/*
 *@USART_Baud
 *Possible options for USART_Baud
 */
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define SUART_STD_BAUD_3M 					3000000


/*
 *@USART_ParityControl
 *Possible options for USART_ParityControl
 */
#define USART_PARITY_EN_ODD   2
#define USART_PARITY_EN_EVEN  1
#define USART_PARITY_DISABLE   0

/*
 *@USART_WordLength
 *Possible options for USART_WordLength
 */
#define USART_WORDLEN_8BITS  0
#define USART_WORDLEN_9BITS  1

/*
 *@USART_NoOfStopBits
 *Possible options for USART_NoOfStopBits
 */
#define USART_STOPBITS_1     0
#define USART_STOPBITS_0_5   1
#define USART_STOPBITS_2     2
#define USART_STOPBITS_1_5   3


/*
 *@USART_HWFlowControl
 *Possible options for USART_HWFlowControl
 */
#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS    	1
#define USART_HW_FLOW_CTRL_RTS    	2
#define USART_HW_FLOW_CTRL_CTS_RTS	3


/*
 * USART flags
 */

#define USART_FLAG_TXE 			( 1 << USART_SR_TXE)
#define USART_FLAG_RXNE 		( 1 << USART_SR_RXNE)
#define USART_FLAG_TC 			( 1 << USART_SR_TC)

/*
 * Application states
 */
#define USART_BUSY_IN_RX 1
#define USART_BUSY_IN_TX 2
#define USART_READY 0


#define 	USART_EVENT_TX_CMPLT   0
#define		USART_EVENT_RX_CMPLT   1
#define		USART_EVENT_IDLE      2
#define		USART_EVENT_CTS       3
#define		USART_EVENT_PE        4
#define		USART_ERR_FE     	5
#define		USART_ERR_NE    	 6
#define		USART_ERR_ORE    	7

/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/


/*
 * Peripheral Clock setup
 */
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);

/*
 * Init and De-init
 */
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_DeInit(USART_Handle_t *pUSARTHandle);

/*
 * Data Send and Receive
 */
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len);
void  USART_ReceiveData(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer, uint32_t Len);

/*
 * IRQ Configuration and ISR handling
 */
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void USART_IRQHandling(USART_Handle_t *pUSARTHandle);

/*
 * Other Peripheral Control APIs
 */

uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint8_t StatusFlagName);
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName);
void USART_Peripheralcontrol(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);


/*
 * Application Callbacks
 */
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t ApEv);









#endif /* INC_STM32F411XX_UART_DRIVER_H_ */
